// let number = 0;

// if (number === 0) {
//   console.log("Ви вибрали 0");
// } else if (number < 0) {
//   console.log("Ви вибрали негативне число");
// } else {
//   console.log("Ви вибрали позитивне число");
// }

// console.log("Hello World")

// for (let i = 1; i <= 10; i += 1) {
//   console.log(`${i} Hello World`)
// }

// for (старт циклу; умова продовження циклу(поки умова істина - цикл продовжується, як тільки умова стане хибною - цикл завершиться); крок циклу)

// for (let i = 10; i >= 1; i -= 1) {
//     console.log(i)
//   }

// for (let i = 2; i <= 100; i += 2){
//     console.log(i);
// }

// for (let i = 1; i <= 100; i += 2){
//   if (i % 2 === 0) {
//     console.log(i);
//   }
// }

// while - виконується до тих пір поки умова буде true (часто використовується тоді, коли ми не знаємо кількість ітерацій)

// while (умова) { тіло циклу - буде виконуватись тоді, коли умова буде true, якщо умова буде false - цикл завершується }

// let word = "книга"

// let userWord = prompt("Я загадав слово! Спробуй його вгадати: ");

// while (word !== userWord) {
//   userWord = prompt("Невірно! Спробуй ще раз: ");
// }

// alert("Ти вгадав, вітаю!");

// запитати у користувача його нікнейм. Якщо він ввів будь-який текст - то просто привітатись(Привіт, юзернейм). Але Якщо він ввів слово admin - то заптати пароль. Якщо він ввів пароль admin - то сказати: Ви увійшли в систему. Якщо ж пароль невірний - то питати до тих пір, поки не напише правильний

// let lname = prompt("введіть своє імя");

// if (lname === "lesha") {
//   let password = prompt("ведіть пароль");

//   while (password !== "lesha") {
//     password = prompt("не вірний пароль");
//   }

//   alert("ви увійшли в акаунт");
// } else if (lname) {
//   alert(`привіт ${lname}`);
// } else {
//   alert("ви нічого не ввели");
// }


// let username = prompt('Будь ласка, введіть ваш нікнейм:');

// if (username.toLowerCase() === 'admin') {
//   while (prompt('Будь ласка, введіть пароль:') !== 'admin') {}
  
//   alert('Ви увійшли в систему.');
// } else {
//   alert(`Привіт, ${username}!`);
// }


